---
kind: method
id: M:Autodesk.Revit.DB.IFC.RoofComponents.GetCurveLoops
source: html/fc2c72f5-1812-cb28-6665-03794e359f54.htm
---
# Autodesk.Revit.DB.IFC.RoofComponents.GetCurveLoops Method

The CurveLoops of roof slabs.

## Syntax (C#)
```csharp
public IList<CurveLoop> GetCurveLoops()
```

## Returns
The CurveLoops.